In [1]:
# Python packages

import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
pd.pandas.set_option('display.max_columns',None)

In [2]:
# Loading dataset

dataset = pd.read_csv("https://raw.githubusercontent.com/iamaakashpal/Insurance-Premium-Prediction/main/dataset/archive.zip")

In [3]:
# Displaying dataset

dataset

      age     sex   bmi  children smoker     region  expenses
0      19  female  27.9         0    yes  southwest  16884.92
1      18    male  33.8         1     no  southeast   1725.55
2      28    male  33.0         3     no  southeast   4449.46
3      33    male  22.7         0     no  northwest  21984.47
4      32    male  28.9         0     no  northwest   3866.86
...   ...     ...   ...       ...    ...        ...       ...
1333   50    male  31.0         3     no  northwest  10600.55
1334   18  female  31.9         0     no  northeast   2205.98
1335   18  female  36.9         0     no  southeast   1629.83
1336   21  female  25.8         0     no  southwest   2007.95
1337   61  female  29.1         0    yes  northwest  29141.36

[1338 rows x 7 columns]

In [4]:
# Duplicate value

dataset[dataset.duplicated()]

     age   sex   bmi  children smoker     region  expenses
581   19  male  30.6         0     no  northwest   1639.56

In [5]:
# Dropping Duplicate Values

dataset.drop_duplicates(inplace=True)

In [6]:
# Shape of dataset

dataset.shape

(1337, 7)

In [7]:
dataset.head()

   age     sex   bmi  children smoker     region  expenses
0   19  female  27.9         0    yes  southwest  16884.92
1   18    male  33.8         1     no  southeast   1725.55
2   28    male  33.0         3     no  southeast   4449.46
3   33    male  22.7         0     no  northwest  21984.47
4   32    male  28.9         0     no  northwest   3866.86

In [8]:
# Splitting Data into Independent and Dependent Variable

x = dataset.iloc[:,:-1]
y = dataset.iloc[:,-1]

In [9]:
x

      age     sex   bmi  children smoker     region
0      19  female  27.9         0    yes  southwest
1      18    male  33.8         1     no  southeast
2      28    male  33.0         3     no  southeast
3      33    male  22.7         0     no  northwest
4      32    male  28.9         0     no  northwest
...   ...     ...   ...       ...    ...        ...
1333   50    male  31.0         3     no  northwest
1334   18  female  31.9         0     no  northeast
1335   18  female  36.9         0     no  southeast
1336   21  female  25.8         0     no  southwest
1337   61  female  29.1         0    yes  northwest

[1337 rows x 6 columns]

In [10]:
y

0       16884.92
1        1725.55
2        4449.46
3       21984.47
4        3866.86
          ...
1333    10600.55
1334     2205.98
1335     1629.83
1336     2007.95
1337    29141.36
Name: expenses, Length: 1337, dtype: float64

In [11]:
x.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
dtype: object

In [12]:
pd.get_dummies(dataset,columns=['sex'],drop_first=True)

      age   bmi  children smoker     region  expenses  sex_male
0      19  27.9         0    yes  southwest  16884.92         0
1      18  33.8         1     no  southeast   1725.55         1
2      28  33.0         3     no  southeast   4449.46         1
3      33  22.7         0     no  northwest  21984.47         1
4      32  28.9         0     no  northwest   3866.86         1
...   ...   ...       ...    ...        ...       ...       ...
1333   50  31.0         3     no  northwest  10600.55         1
1334   18  31.9         0     no  northeast   2205.98         0
1335   18  36.9         0     no  southeast   1629.83         0
1336   21  25.8         0     no  southwest   2007.95         0
1337   61  29.1         0    yes  northwest  29141.36         0

[1337 rows x 7 columns]

In [13]:
dataset = pd.get_dummies(dataset,columns=['sex','smoker','region'],drop_first=True)

In [14]:
dataset.head()

,age,bmi,children,expenses,sex_male,smoker_yes,region_northwest,region_southeast,region_southwest
0,19,27.9,0,16884.92,0,1,0,0,1
1,18,33.8,1,1725.55,1,0,0,1,0
2,28,33.0,3,4449.46,1,0,0,1,0
3,33,22.7,0,21984.47,1,0,1,0,0
4,32,28.9,0,3866.86,1,0,1,0,0